{"backend": "tensorflow", "config": {"input_layers": [["input_2", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_2", "config": {"batch_input_shape": [null, 100, 100, 3], "dtype": "float32", "name": "input_2", "sparse": false}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Model", "name": "mobilenet_1.00_224", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 100, 100, 3], "dtype": "float32", "name": "input_1", "sparse": false}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"trainable": false, "data_format": "channels_last", "dtype": "float32", "padding": [[0, 1], [0, 1]], "name": "conv1_pad"}, "name": "conv1_pad", "class_name": "ZeroPadding2D"}, {"inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "strides": [2, 2], "use_bias": false, "name": "conv1", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv1_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv1_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv1_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv1_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "name": "conv_dw_1", "strides": [1, 1], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "depthwise_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "name": "conv_dw_1", "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_dw_1_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_dw_1_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_dw_1_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_dw_1_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "filters": 64, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": false, "name": "conv_pw_1", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv_pw_1", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_pw_1_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_pw_1_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_pw_1_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_pw_1_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "config": {"trainable": false, "data_format": "channels_last", "dtype": "float32", "padding": [[0, 1], [0, 1]], "name": "conv_pad_2"}, "name": "conv_pad_2", "class_name": "ZeroPadding2D"}, {"inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "name": "conv_dw_2", "strides": [2, 2], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "depthwise_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "name": "conv_dw_2", "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_dw_2_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_dw_2_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_dw_2_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_dw_2_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "filters": 128, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": false, "name": "conv_pw_2", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv_pw_2", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_pw_2_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_pw_2_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_pw_2_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_pw_2_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "name": "conv_dw_3", "strides": [1, 1], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "depthwise_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "name": "conv_dw_3", "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_dw_3_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_dw_3_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_dw_3_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_dw_3_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "filters": 128, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": false, "name": "conv_pw_3", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv_pw_3", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_pw_3_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_pw_3_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_pw_3_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_pw_3_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "config": {"trainable": false, "data_format": "channels_last", "dtype": "float32", "padding": [[0, 1], [0, 1]], "name": "conv_pad_4"}, "name": "conv_pad_4", "class_name": "ZeroPadding2D"}, {"inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "name": "conv_dw_4", "strides": [2, 2], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "depthwise_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "name": "conv_dw_4", "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_dw_4_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_dw_4_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_dw_4_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_dw_4_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "filters": 256, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": false, "name": "conv_pw_4", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv_pw_4", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_pw_4_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_pw_4_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_pw_4_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_pw_4_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "name": "conv_dw_5", "strides": [1, 1], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "depthwise_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "name": "conv_dw_5", "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_dw_5_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_dw_5_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_dw_5_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_dw_5_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "filters": 256, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": false, "name": "conv_pw_5", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv_pw_5", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_pw_5_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_pw_5_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_pw_5_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_pw_5_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "config": {"trainable": false, "data_format": "channels_last", "dtype": "float32", "padding": [[0, 1], [0, 1]], "name": "conv_pad_6"}, "name": "conv_pad_6", "class_name": "ZeroPadding2D"}, {"inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "name": "conv_dw_6", "strides": [2, 2], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "depthwise_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "name": "conv_dw_6", "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_dw_6_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_dw_6_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_dw_6_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_dw_6_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "filters": 512, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": false, "name": "conv_pw_6", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv_pw_6", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_pw_6_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_pw_6_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_pw_6_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_pw_6_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "name": "conv_dw_7", "strides": [1, 1], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "depthwise_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "name": "conv_dw_7", "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_dw_7_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_dw_7_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_dw_7_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_dw_7_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "filters": 512, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": false, "name": "conv_pw_7", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv_pw_7", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_pw_7_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_pw_7_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_pw_7_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_pw_7_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "name": "conv_dw_8", "strides": [1, 1], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "depthwise_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "name": "conv_dw_8", "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_dw_8_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_dw_8_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_dw_8_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_dw_8_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "filters": 512, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": false, "name": "conv_pw_8", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv_pw_8", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_pw_8_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_pw_8_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_pw_8_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_pw_8_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "name": "conv_dw_9", "strides": [1, 1], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "depthwise_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "name": "conv_dw_9", "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_dw_9_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_dw_9_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_dw_9_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_dw_9_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "filters": 512, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": false, "name": "conv_pw_9", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv_pw_9", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_pw_9_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_pw_9_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_pw_9_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_pw_9_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "name": "conv_dw_10", "strides": [1, 1], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "depthwise_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "name": "conv_dw_10", "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_dw_10_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_dw_10_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_dw_10_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_dw_10_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "filters": 512, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": false, "name": "conv_pw_10", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv_pw_10", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_pw_10_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_pw_10_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_pw_10_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_pw_10_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "name": "conv_dw_11", "strides": [1, 1], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "depthwise_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "name": "conv_dw_11", "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_dw_11_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_dw_11_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_dw_11_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_dw_11_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "filters": 512, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": false, "name": "conv_pw_11", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv_pw_11", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_pw_11_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_pw_11_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_pw_11_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_pw_11_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "config": {"trainable": false, "data_format": "channels_last", "dtype": "float32", "padding": [[0, 1], [0, 1]], "name": "conv_pad_12"}, "name": "conv_pad_12", "class_name": "ZeroPadding2D"}, {"inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "name": "conv_dw_12", "strides": [2, 2], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "depthwise_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "name": "conv_dw_12", "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_dw_12_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_dw_12_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_dw_12_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_dw_12_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "filters": 1024, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": false, "name": "conv_pw_12", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv_pw_12", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_pw_12_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_pw_12_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_pw_12_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_pw_12_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "name": "conv_dw_13", "strides": [1, 1], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "depthwise_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null}, "name": "conv_dw_13", "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_dw_13_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_dw_13_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_dw_13_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_dw_13_relu", "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "filters": 1024, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": false, "name": "conv_pw_13", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": false, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv_pw_13", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "axis": [3], "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "conv_pw_13_bn", "scale": true, "trainable": false, "momentum": 0.99, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_pw_13_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "config": {"max_value": 6.0, "name": "conv_pw_13_relu", "negative_slope": 0.0, "trainable": false, "threshold": 0.0, "dtype": "float32"}, "name": "conv_pw_13_relu", "class_name": "ReLU"}], "output_layers": [["conv_pw_13_relu", 0, 0]], "name": "mobilenet_1.00_224"}}, {"inbound_nodes": [[["mobilenet_1.00_224", 1, 0, {}]]], "class_name": "GlobalAveragePooling2D", "name": "global_average_pooling2d", "config": {"trainable": true, "dtype": "float32", "name": "global_average_pooling2d", "data_format": "channels_last"}}, {"inbound_nodes": [[["global_average_pooling2d", 0, 0, {}]]], "class_name": "Dense", "name": "dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 3, "use_bias": true, "name": "dense", "activation": "softmax", "trainable": true, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}], "output_layers": [["dense", 0, 0]], "name": "model"}, "keras_version": "2.2.4-tf", "class_name": "Model"}